#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//正整数 - 原码，反码，补码相同
//负整数 - 原码，反码，补码不同，要进行计算！
//负整数 - 反码 - 除了最高位符号其他反过来
//负整数 - 补码 - 反码的二进制+1
//负数补码 - 减1再取反

//移位操作符 
//int main()
//{
//	////移位操作符只能是整数
//	//int a = 5;
//	//int b = a << 2;
//	////把a在内存中存储的二进制位向左移动2位
//	//printf("%d\n", b);//20
//	//右移操作符
//	//1.算数右移
//	//右边丢弃，左边补原来的符号位
//	//2.逻辑右移
//	//右边丢弃，左边补0
//	//到底属于哪种右移，取决于编译器
//	//常见的编译器都是算数右移
//	int a = 5;
//	int b = a >> 1;
//	printf("%d\n", b);//2
//
//	return 0;
//}

//位操作符
//int main()
//{
//	//& - 按(2进制)位与
//	//| - 按(2进制)位或
//	//^ - 按(2进制)位异或
//	int a = 3;
//	int b = -5;
//	//a和b存在内存中的二进制的补码计算的
//	//int c = a & b;//3
//	//int c = a | b;//-5
//	//异或：相同为0，相异为1
//	int c = a ^ b;//-8
//
//
//	printf("%d", c);
//	return 0;
//}


//不创建临时变量，交换两个变量的值
//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("交换前：a = %d b = %d\n", a, b);
//
//
//	//方法1
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//
//	//方法 - 异或
//	a = a ^ b;
//	b = a ^ b;//a^b^b = 原来的a
//	a = a ^ b;//a^b^(上一行的b)a
//	printf("交换后：a = %d b = %d\n", a, b);
//	return 0;
//}

//赋值操作符
//int main()
//{
//	//int a = 10;
//	//a = 100;
//	//左值，是可以放在等号左边的，一般是一块空间
//	//右值，是可以放在等号右边的，一般是一个值，或者一块空间的内容
//
//	//单目操作符
//
//	int a = 0;
//	//~ 按（内存中补码的2进制）位取反
//	//00000000000000000000000000000000
//	//11111111111111111111111111111111 - 补码
//	//11111111111111111111111111111110 - 反码
//	//10000000000000000000000000000001 - 源码 --> -1
//	printf("%d\n", ~a);//-1
//
//
//	return 0;
//}

int main()
{
	int a = 10;
	a |= (1 << 2);
	//00000000000000000000000000001010
	//00000000000000000000000000000100 - 或 (1 << 2)
	//00000000000000000000000000001110 - 14
	printf("%d\n", a);//14
	a &= !(1 << 2);
	printf("%d\n", a);//0
	return 0;
}